amurzeau/damc_stm32f723disco/src/stm32n6570-dk/FSBL/BSP/stm32n6570_discovery_audio.c
   + For each mode, you may need to implement the relative callback functions into your code.
      The Callback functions are named BSP_AUDIO_IN_XXX_CallBack() and only their prototypes are declared in
      the stm32n6570_discovery_audio.h file (refer to the example for more details on the callbacks implementations).

   + The driver API and the callback functions are at the end of the stm32n6570_discovery_audio.h file.

  @endverbatim
  *
  ******************************************************************************
  */

/* Includes ------------------------------------------------------------------*/
#include "stm32n6570_discovery_audio.h"
#include "stm32n6570_discovery_bus.h"

/** @addtogroup BSP
  * @{
  */

/** @addtogroup STM32N6570_DISCOVERY
  * @{
  */

/** @defgroup STM32N6570_DISCOVERY_AUDIO AUDIO
  * @{
  */

/** @defgroup STM32N6570_DISCOVERY_AUDIO_Private_Macros AUDIO Private Macros
  * @{
  */
#define SaturaLH(N, L, H) (((N)<(L))?(L):(((N)>(H))?(H):(N)))

#define MDF_DECIMATION_RATIO(__FREQUENCY__) \
        ((__FREQUENCY__) == (AUDIO_FREQUENCY_8K))   ? (64U) \
      : ((__FREQUENCY__) == (AUDIO_FREQUENCY_11K))  ? (64U) \
      : ((__FREQUENCY__) == (AUDIO_FREQUENCY_16K))  ? (32U) \
      : ((__FREQUENCY__) == (AUDIO_FREQUENCY_22K))  ? (32U) \
      : ((__FREQUENCY__) == (AUDIO_FREQUENCY_32K))  ? (16U) \
      : ((__FREQUENCY__) == (AUDIO_FREQUENCY_44K))  ? (16U)  \
      : ((__FREQUENCY__) == (AUDIO_FREQUENCY_48K))  ? (16U)  \
      : ((__FREQUENCY__) == (AUDIO_FREQUENCY_96K))  ? (8U) : (4U)

#define MDF_GAIN(__FREQUENCY__) \
        ((__FREQUENCY__) == (AUDIO_FREQUENCY_8K))   ? (-4)  \
      : ((__FREQUENCY__) == (AUDIO_FREQUENCY_11K))  ? (-6) \
      : ((__FREQUENCY__) == (AUDIO_FREQUENCY_16K))  ? (2) \
      : ((__FREQUENCY__) == (AUDIO_FREQUENCY_22K))  ? (2) \
      : ((__FREQUENCY__) == (AUDIO_FREQUENCY_32K))  ? (10)  \
      : ((__FREQUENCY__) == (AUDIO_FREQUENCY_44K))  ? (10)  \
      : ((__FREQUENCY__) == (AUDIO_FREQUENCY_48K))  ? (10)  \
      : ((__FREQUENCY__) == (AUDIO_FREQUENCY_96K))  ? (18) : (24)

#define MDF_CIC_MODE(__FREQUENCY__) \
        ((__FREQUENCY__) == (AUDIO_FREQUENCY_8K))   ? (MDF_ONE_FILTER_SINC4) \
      : ((__FREQUENCY__) == (AUDIO_FREQUENCY_11K))  ? (MDF_ONE_FILTER_SINC4) \
      : ((__FREQUENCY__) == (AUDIO_FREQUENCY_16K))  ? (MDF_ONE_FILTER_SINC4) \
      : ((__FREQUENCY__) == (AUDIO_FREQUENCY_22K))  ? (MDF_ONE_FILTER_SINC4) \
      : ((__FREQUENCY__) == (AUDIO_FREQUENCY_32K))  ? (MDF_ONE_FILTER_SINC4) \
      : ((__FREQUENCY__) == (AUDIO_FREQUENCY_44K))  ? (MDF_ONE_FILTER_SINC4) \
      : ((__FREQUENCY__) == (AUDIO_FREQUENCY_48K))  ? (MDF_ONE_FILTER_SINC4) \
      : ((__FREQUENCY__) == (AUDIO_FREQUENCY_96K))  ? (MDF_ONE_FILTER_SINC4) : (MDF_ONE_FILTER_SINC4)

#define MDF_PROC_CLOCK_DIVIDER(__FREQUENCY__) \
        ((__FREQUENCY__) == (AUDIO_FREQUENCY_8K))   ? (2U) \
      : ((__FREQUENCY__) == (AUDIO_FREQUENCY_11K))  ? (1U) \
      : ((__FREQUENCY__) == (AUDIO_FREQUENCY_16K))  ? (2U) \
      : ((__FREQUENCY__) == (AUDIO_FREQUENCY_22K))  ? (1U) \
      : ((__FREQUENCY__) == (AUDIO_FREQUENCY_32K))  ? (2U)  \
      : ((__FREQUENCY__) == (AUDIO_FREQUENCY_44K))  ? (1U)  \
      : ((__FREQUENCY__) == (AUDIO_FREQUENCY_48K))  ? (2U)  \
      : ((__FREQUENCY__) == (AUDIO_FREQUENCY_96K))  ? (2U) : (1U)

#define MDF_OUTPUT_CLOCK_DIVIDER(__FREQUENCY__) \
        ((__FREQUENCY__) == (AUDIO_FREQUENCY_8K))   ? (12U) \
      : ((__FREQUENCY__) == (AUDIO_FREQUENCY_11K))  ? (4U)  \
      : ((__FREQUENCY__) == (AUDIO_FREQUENCY_16K))  ? (12U) \
      : ((__FREQUENCY__) == (AUDIO_FREQUENCY_22K))  ? (4U)  \
      : ((__FREQUENCY__) == (AUDIO_FREQUENCY_32K))  ? (12U)  \
      : ((__FREQUENCY__) == (AUDIO_FREQUENCY_44K))  ? (4U)  \
      : ((__FREQUENCY__) == (AUDIO_FREQUENCY_48K))  ? (8U)  \
      : ((__FREQUENCY__) == (AUDIO_FREQUENCY_96K))  ? (16U) : (16U)
/**
  * @}
  */

/** @defgroup STM32N6570_DISCOVERY_AUDIO_Exported_Variables AUDIO Exported Variables
  * @{
  */
/* Audio in and out context */
AUDIO_OUT_Ctx_t Audio_Out_Ctx[AUDIO_OUT_INSTANCES_NBR] = {{AUDIO_OUT_DEVICE_HEADPHONE,
                                                           AUDIO_FREQUENCY_8K,
                                                           AUDIO_RESOLUTION_16B,
                                                           50U,
                                                           2U,
                                                           AUDIO_MUTE_DISABLED,
                                                           AUDIO_OUT_STATE_RESET,
                                                           0U}};

AUDIO_IN_Ctx_t  Audio_In_Ctx[AUDIO_IN_INSTANCES_NBR] = {{AUDIO_IN_DEVICE_ANALOG_MIC,
                                                         AUDIO_FREQUENCY_8K,
                                                         AUDIO_RESOLUTION_16B,
                                                         1U,
                                                         NULL,
                                                         0U,
                                                         50U,
                                                         AUDIO_IN_STATE_RESET,
                                                         0U},
                                                        {AUDIO_IN_DEVICE_DIGITAL_MIC,
                                                         AUDIO_FREQUENCY_8K,
                                                         AUDIO_RESOLUTION_16B,
                                                         1U,
                                                         NULL,
                                                         0U,
                                                         50U,
                                                         AUDIO_IN_STATE_RESET,
                                                         0U}};

/* Audio component object */
void *Audio_CompObj = NULL;

/* Audio driver */
AUDIO_Drv_t *Audio_Drv = NULL;

/* Play  */
SAI_HandleTypeDef  haudio_out_sai = {NULL};

/* Record  */
SAI_HandleTypeDef  haudio_in_sai = {NULL};
//MDF_HandleTypeDef  haudio_in_mdf = {NULL};

/* Audio in and out DMA handles used by SAI and MDF */
DMA_HandleTypeDef  hDmaSaiTx = {NULL}, hDmaSaiRx = {NULL}, hDmaMdf = {NULL};
/**
  * @}
  */

